In [1]:
import pandas as pd
df=pd.read_csv("income.csv")
df

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,62993,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [3]:
# to find the sum of a particular column
s=0
for i in df["2011"]:
    s=s+i
print(s)

243311

In [4]:
# To find the sum of the particular row
df.loc[1]

GEOID    04000US02
State       Alaska
2005         55891
2006         56418
2007         62993
2008         63989
2009         61604
2010         57848
2011         57431
2012         63648
2013         61137
Name: 1, dtype: object

In [5]:
df.iloc[1,2:]

2005    55891
2006    56418
2007    62993
2008    63989
2009    61604
2010    57848
2011    57431
2012    63648
2013    61137
Name: 1, dtype: object

In [7]:
s=0
for i in df.iloc[1,2:]:
    s=s+i
print(s)

540959

In [9]:
df["2009"].sum()

239995

In [10]:
# 4th row and all columns
df.iloc[4,2:].sum()

498154

In [16]:
df["2006"].sum()

233403

In [17]:
df.iloc[:,2:6].sum()

2005    226699
2006    233403
2007    264727
2008    251979
dtype: int64

In [20]:
a=df.iloc[:,2:6].sum()
a.sum()

976808

In [25]:
a=df.iloc[:,2:11].sum()
a.sum()

2199422

In [26]:
df.sum()  #To find the total sum of individual columns

GEOID    04000US0104000US0204000US0404000US0504000US06
State           AlabamaAlaskaArizonaArkansasCalifornia
2005                                            226699
2006                                            233403
2007                                            264727
2008                                            251979
2009                                            239995
2010                                            238547
2011                                            243311
2012                                            250194
2013                                            250567
dtype: object

In [28]:
df.sum(1)   #To find the total sum of individual rows

0    370138
1    540959
2    440711
3    349460
4    498154
dtype: int64

In [29]:
df.prod(1)    #to find the product

0   -6539681619962626048
1   -7361322062891165696
2   -5081084018388558592
3    3972055575382497440
4   -3135361311448388864
dtype: int64

In [38]:
a=df.iloc[1:3,2:6].prod()    # To find the product sum
a.prod()

3892897880436685324

In [44]:
# Mean To find the average
#Find the avg of 2011 column
#Find the avg of 2nd Row 
df["2011"].mean()

48662.2

In [48]:
df.iloc[2,2:].mean()  # avg of 2nd row

48967.88888888889

In [49]:
df["2011"].median()

48621.0

In [50]:
df.iloc[2,2:].median()

46914.0

### Combined average income of all states

In [54]:
df.iloc[0:,2:].mean().mean() #2nd writing index values for columns

48876.044444444444

### State with highest average income in the last three years

In [83]:
import pandas as pd
dc=pd.read_csv("income.csv",index_col="State")    #dc.index=df["state"]

dc.iloc[:,8:11].mean(1).idxmax()

'Alaska'

In [100]:
df.index=df["State"]

In [84]:
df.iloc[:,-3:] #values of last three years

    2011   2012   2013
0  42590  43464  41381
1  57431  63648  61137
2  48621  47044  50602
3  41302  39018  39919
4  53367  57020  57528

In [102]:
df.iloc[:,-3:].mean(1).idxmax()

'Alaska'

In [90]:
df.iloc[:,-3:].mean(1)  
                    #row wise avg of last three years

0    42478.333333
1    60738.666667
2    48755.666667
3    40079.666667
4    55971.666667
dtype: float64

In [93]:
df["last three years avg"]=df.iloc[:,-3:].mean(1)  
df

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013,last three years avg
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381,42441.111111
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137,61841.222222
2,04000US04,Arizona,45245,46657,62993,46914,45739,46896,48621,47044,50602,48800.555556
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919,39672.222222
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528,56839.888889

In [95]:
df["last three years avg"]==max(df["last three years avg"])  #boolean masking

0    False
1     True
2    False
3    False
4    False
Name: last three years avg, dtype: bool

In [101]:
df[df["last three years avg"]==max(df["last three years avg"])].index[0]  #boolean masking

'Alaska'

### State with lowest average income from 2007 to 2010(inclusive)

In [78]:
dc.iloc[:,4:8].mean(1).idxmin()

'Arkansas'


### Print the list of all states in the same line with average income less than California

In [107]:
a=df.iloc[:,2:].mean(1)
a

State
Alabama       41257.911111
Alaska        60280.022222
Arizona       48951.155556
Arkansas      38913.222222
California    55499.388889
dtype: float64

In [105]:
# a.iloc[-1]

55499.38888888889

In [108]:
calavg=df.iloc[-1,2:].mean()
calavg

55499.38888888889

In [110]:
df[df.iloc[:,2:].mean(1)<calavg].index
list(df[df.iloc[:,2:].mean(1)<calavg].index)

['Alabama', 'Arizona', 'Arkansas']

 ### Print the names of states based on descending order of income in the year 2009

In [117]:
w=df["2009"] 
w                 #df.iloc[:,6]

State
Alabama       39980
Alaska        61604
Arizona       45739
Arkansas      36538
California    56134
Name: 2009, dtype: int64

In [116]:
b=w.sort_values(ascending=False)
b

State
Alaska        61604
California    56134
Arizona       45739
Alabama       39980
Arkansas      36538
Name: 2009, dtype: int64

In [119]:
list(b.index)

['Alaska', 'California', 'Arizona', 'Alabama', 'Arkansas']


### State with the lowest recorded income from 2005 to 2013'''

In [128]:
df.iloc[:,2:11].idxmin()

2005    Arkansas
2006    Arkansas
2007    Arkansas
2008    Arkansas
2009    Arkansas
2010    Arkansas
2011    Arkansas
2012    Arkansas
2013    Arkansas
dtype: object

In [79]:
df.iloc[0:,2:].mean()   #colunm wise avg

2005    45339.8
2006    46680.6
2007    52945.4
2008    50395.8
2009    47999.0
2010    47709.4
2011    48662.2
2012    50038.8
2013    50113.4
dtype: float64

In [82]:
df.iloc[:,2:].mean(1)    #Row wise avg  
                         #if we use 1 in mean paranthesis we get row wise avg

0    41126.444444
1    60106.555556
2    48967.888889
3    38828.888889
4    55350.444444
dtype: float64